/**
 * @file xapi.h
 * @note API類別
 * @author yinweli
 */
#pragma once
#pragma warning(disable:4100; disable:4786)
//-----------------------------------------------------------------------------
#ifndef _XERROR
#define _XERROR
//-----------------------------------------------------------------------------
_NSTD_BEGIN; ///< namespace start
//-----------------------------------------------------------------------------
#define WSASUCCESS 0 ///< Winsock成功代碼 @ingroup xapi
//-----------------------------------------------------------------------------
struct S_XOverlapped;
//-----------------------------------------------------------------------------
/**
 * @brief Winsock錯誤類別
 * @ingroup xapi
 */
class C_ErrorWSA : public C_ErrorBase
{
private:
	//-------------------------------------
	int m_iWSAError; ///< Winsock錯誤代碼
	//-------------------------------------

public:
	//-------------------------------------
	C_ErrorWSA();
	C_ErrorWSA(IN int wsaerror);
	C_ErrorWSA(IN S_XOverlapped &overlapped);
	virtual ~C_ErrorWSA();
	//-------------------------------------
	operator int () const;
	operator estring () const;
	//-------------------------------------
};
//-----------------------------------------------------------------------------
_NSTD_END; ///< namespace end
//-----------------------------------------------------------------------------
#endif
//-----------------------------------------------------------------------------