/**
 * @file whandle.h
 * @note 控制代碼類別
 * @author yinweli
 */
/**
 * @page 如何使用whandle
 * C_WHandle 用於windows的控制代碼, 可在解構時自動呼叫 CloseHandle() 函式\n\n
 * --------------------------------------------------\n
 * Header           : whandle.h\n
 * Library(debug)   : nstd_debug.lib\n
 * Library(release) : nstd_release.lib\n
 * --------------------------------------------------\n
 * 詳細說明請參照 @ref whandle
 */
/** @defgroup whandle */
#pragma once
#pragma warning(disable:4100; disable:4786)
//-----------------------------------------------------------------------------
#ifndef _WHANDLE
#define _WHANDLE
//-----------------------------------------------------------------------------
#include "..\_nstd\_nstd.h"
#include "..\_nstderr\_nstderr.h"
//-----------------------------------------------------------------------------
_NSTD_BEGIN; ///< namespace start
//-----------------------------------------------------------------------------
/**
 * @brief 控制代碼類別
 * @ingroup whandle
 */
class C_WHandle
{
private:
	//-------------------------------------
	HANDLE m_hHandle; ///< 控制代碼
	//-------------------------------------

public:
	//-------------------------------------
	C_WHandle(IN HANDLE hHandle);
	virtual ~C_WHandle();
	//-------------------------------------
	operator HANDLE () const;
	//-------------------------------------
};
//-----------------------------------------------------------------------------
_NSTD_END; ///< namespace end
//-----------------------------------------------------------------------------
#endif
//-----------------------------------------------------------------------------