/**
 * @file output.h
 * @note 輸出組件
 * @author yinweli
 */
#pragma once
#pragma warning(disable:4100; disable:4786)
//-----------------------------------------------------------------------------
#ifndef _OUTPUT
#define _OUTPUT
//-----------------------------------------------------------------------------
/**
 * @brief 輸出類別
 */
class C_Output
{
private:
	//-------------------------------------
	std::deque<cstring> m_Data; ///< 輸出資料
	//-------------------------------------
	CRITICAL_SECTION m_csCommon; ///< 共用同步鎖
	//-------------------------------------

public:
	//-------------------------------------
	C_Output();
	virtual ~C_Output();
	//-------------------------------------
	/**
	 * @brief 清除全部
	 */
	void Clear();
	/**
	 * @brief 新增輸出
	 * @param szOutput 輸出字串
	 */
	void Add(IN const cstring &szOutput);
	/**
	 * @brief 取得輸出
	 * @return 輸出字串
	 */
	cstring Get();
	//-------------------------------------
};
//-----------------------------------------------------------------------------
#endif
//-----------------------------------------------------------------------------