//-----------------------------------------------------------------------------
#include "progress.h"
//-----------------------------------------------------------------------------
_NSTD_BEGIN;
//-----------------------------------------------------------------------------
C_Progress::C_Progress() : m_iStart(0), m_iEnd(0), m_iNow(0) {}
//-----------------------------------------------------------------------------
C_Progress::C_Progress(IN int iStart, IN int iEnd, IN int iNow)
{
	SetValue(iStart, iEnd);
	SetNow(iNow);
}
//-----------------------------------------------------------------------------
C_Progress::~C_Progress() {}
//-----------------------------------------------------------------------------
// 全部清除
void C_Progress::Clear()
{
	m_iStart = m_iEnd = m_iNow = 0;
}
//-----------------------------------------------------------------------------
// 設定開始值, 結束值
void C_Progress::SetValue(IN int iStart, IN int iEnd)
{
	if(iStart > iEnd)
	{
		m_iStart = iEnd;
		m_iEnd = iStart;
	}
	else
	{
		m_iStart = iStart;
		m_iEnd = iEnd;
	}//if
}
//-----------------------------------------------------------------------------
// 設定現在值
void C_Progress::SetNow(IN int iNow)
{
	m_iNow = iNow;
	Process();
}
//-----------------------------------------------------------------------------
// 增加現在值
void C_Progress::AddNow(IN int iNow)
{
	m_iNow += iNow;
	Process();
}
//-----------------------------------------------------------------------------
// 減少現在值
void C_Progress::SubNow(IN int iNow)
{
	m_iNow -= iNow;
	Process();
}
//-----------------------------------------------------------------------------
// 取得現在值
int C_Progress::GetNow() const
{
	return m_iNow;
}
//-----------------------------------------------------------------------------
// 取得百分比進度值
float C_Progress::GetProgressValue() const
{
	return (((float)m_iNow - (float)m_iStart) / ((float)m_iEnd - (float)m_iStart)) * 100;
}
//-----------------------------------------------------------------------------
// 進度更新函式
void C_Progress::Process() const
{
	// 啥事都不作
}
//-----------------------------------------------------------------------------
_NSTD_END;
//-----------------------------------------------------------------------------